testCases/testPyro1/constant/pyrolysisProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solid density
rhoS    rhoS [ 1 -3 0 0 0 0 0 ] 1800;

//constant burning rate (kg/m2/s) - 6.8 WSB paper, matching order of magnitude
m0      m0   [ 1 -2 -1 0 0 0 0] 10;

// ************************************************************************* //
